ERP DEV.WMS/src/DataProcessors/вмс_ЗащищенныйМодуль/вмс_ЗащищенныйМодуль.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>вмс_ЗащищенныйМодуль</name>
</mdclass:DataProcessor>

ERP DEV.WMS/src/InformationRegisters/вмс_СоединениеОбъектов/вмс_СоединениеОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_СоединениеОбъектов</name>
  <resources>
    <name>ОсновнойРесурс</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектИсточник</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектПриемник</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Схема</name>
    <type>
      <types>CatalogRef.вмс_СхемыСоединенияОбъектов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительноеИзмерение1</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительноеИзмерение2</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительноеИзмерение3</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/AccumulationRegisters/вмс_ОстаткиВКонтейнерах/вмс_ОстаткиВКонтейнерах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>вмс_ОстаткиВКонтейнерах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контейнер</name>
    <type>
      <types>CatalogRef.вмс_Контейнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.вмс_Контейнеры</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.вмс_ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.вмс_СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>EnumRef.вмс_КачествоТовара</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Маркировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ХешСуммаКодаМаркировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УчетныйПараметр1</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчетныйПараметр2</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP DEV.WMS/src/AccumulationRegisters/вмс_ОперацияПоЯчейкам/вмс_ОперацияПоЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>вмс_ОперацияПоЯчейкам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПланируемыйРасход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПланируемыйПриход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контейнер</name>
    <type>
      <types>CatalogRef.вмс_Контейнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.вмс_СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.вмс_ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>EnumRef.вмс_КачествоТовара</types>
    </type>
  </dimensions>
  <dimensions>
    <name>удалитьАналитика</name>
    <type>
      <types>CatalogRef.вмс_АналитикаУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>удалитьУчетныйПараметр1</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>удалитьУчетныйПараметр2</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP DEV.WMS/src/Catalogs/вмс_НастройкиПрограммы/вмс_НастройкиПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_НастройкиПрограммы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Значение</name>
    <type>
      <types>EnumRef.вмс_ТипыПодключенияКИС</types>
      <types>CatalogRef.вмс_МестаХранения</types>
      <types>Boolean</types>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>EnumRef.вмс_СпособыУпаковкиДанныхОбмена</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрСеанса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеЗагружатьИзИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяХранилище</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Форма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_Контейнеры/вмс_Контейнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_Контейнеры</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ТипТары</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ТипыКонтейнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.вмс_ВидыПартийТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПартии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОснования</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Вскрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/ChartsOfCharacteristicTypes/ТипыКонтейнеров/ТипыКонтейнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ТипыКонтейнеров</name>
  <type>
    <types>String</types>
    <stringQualifiers>
      <length>10</length>
    </stringQualifiers>
  </type>
  <attributes>
    <name>ВидКонтейнера</name>
    <type>
      <types>EnumRef.вмс_ВидыКонтейнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяПечатнаяФорма</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВнешнююПечатнуюФорму</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <type>
      <types>CatalogRef.ШаблоныЭтикеток_WMS</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОперацииОтветственногоХранения</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.вмс_УслугиОтветственногоХранения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

ERP DEV.WMS/src/DataProcessors/вмс_ЗащищенныйМодуль/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	

#Область ПрограммныйИнтерфейс

// ТУ_Кошелев 06.08.24 - проверка доступности лицензий на разные подсистемы

// Определяет доступность подсистемы по имени лицензии.
//
// Параметры:
//  ИмяЛицензии - Строка - идентификатор лицензии.
//
// Возвращаемое значение:
//  Булево - Истина.
//
Функция ПодсистемаДоступна(ИмяЛицензии) Экспорт
	//Отключена проверка до доработки программы генерации лицензий
	//Возврат Истина;
	Возврат Вычислить(ИмяЛицензии + "Доступна()");
КонецФункции

// ТУ_Кошелев 17.06.24 - Обертка для выполнения всех функций с проверкой

// Выполняет функцию контейнеров с параметрами при наличии лицензии.
//
// Параметры:
//  - ИмяФункции - Строка    - имя вызываемой функции.
//  - Параметры  - Структура - параметры функции, где ключ - имя параметра, значение - значение параметра.
//
// Возвращаемое значение:
//  - Произвольный - результат выполнения вызванной функции, либо Ложь при отсутствии лицензии.
//
Функция ВыполнитьФункциюКонтейнеров(ИмяФункции, Параметры) Экспорт  
	Если НЕ вмс_ЛицензияКонтейнерыДоступна() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТекстВыполнения = ИмяФункции + "("; 
	
	Для Каждого Параметр Из Параметры Цикл
		ТекстВыполнения = ТекстВыполнения + "Параметры." + Параметр.Ключ + ", ";
	КонецЦикла; 
	
	Если Параметры.Количество() <> 0 Тогда
		ТекстВыполнения = Лев(ТекстВыполнения, СтрДлина(ТекстВыполнения) - 2);
	КонецЕсли;                           
	
	ТекстВыполнения = ТекстВыполнения + ")";
	
	Возврат Вычислить(ТекстВыполнения);
КонецФункции
//

Функция ПолучитьИмяМодуля() Экспорт
	Возврат ЭтотОбъект.Метаданные().Имя;
КонецФункции

Функция ПроверитьДоступностьЛицензииПоКоду(ИмяЛицензии,КодЛицензии) Экспорт
	
	Попытка
		ЦыфиркаЛицензии = "";
		Цыфирки = вмс_РаботаСКоллекциями.СтрокуВМассивПосимвольно(КодЛицензии);
		ЦыфиркаПервая = Число(Цыфирки[0]);
		ЦыфиркаВторая = Число(Цыфирки[1]);
		ЦыфиркаЛицензии = ЦыфиркаЛицензии + Цыфирки[ЦыфиркаПервая + 2];
		ЦыфиркаЛицензии = ЦыфиркаЛицензии + Цыфирки[ЦыфиркаВторая + 2];
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Если ИмяЛицензии = "вмс_ЛицензияСклад" Тогда
		ПроверкаЛицензии = "01";
		Если ПроверкаЛицензии = ЦыфиркаЛицензии Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли ИмяЛицензии = "вмс_ЛицензияМагазин" Тогда
		ПроверкаЛицензии = "02";
		Если ПроверкаЛицензии = ЦыфиркаЛицензии Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли ИмяЛицензии = "вмс_ЛицензияКонтейнеры" Тогда
		ПроверкаЛицензии = "03";
		Если ПроверкаЛицензии = ЦыфиркаЛицензии Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	ИначеЕсли ИмяЛицензии = "вмс_ЛицензияОХР" Тогда
		ПроверкаЛицензии = "04";
		Если ПроверкаЛицензии = ЦыфиркаЛицензии Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

//Разбивка функций по подсистемам, чтобы сэкономить 1/1000000000 мс. на каждой операции. Они будут вызываться часто.
Функция вмс_ЛицензияСкладДоступна()
	ИмяЛицензии = "вмс_ЛицензияСклад";
	Лицензия = вмс_СтандартныеПодсистемыПовтИсп.ПолучитьЛицензиюФункциональнойПодсистемы(ИмяЛицензии);
	Возврат ПроверитьДоступностьЛицензииПоКоду(ИмяЛицензии, Лицензия);
КонецФункции

Функция вмс_ЛицензияМагазинДоступна()
	ИмяЛицензии = "вмс_ЛицензияМагазин";
	Лицензия = вмс_СтандартныеПодсистемыПовтИсп.ПолучитьЛицензиюФункциональнойПодсистемы(ИмяЛицензии);
	Возврат ПроверитьДоступностьЛицензииПоКоду(ИмяЛицензии, Лицензия);
КонецФункции

Функция вмс_ЛицензияКонтейнерыДоступна() Экспорт
	ИмяЛицензии = "вмс_ЛицензияКонтейнеры";
	Лицензия = вмс_СтандартныеПодсистемыПовтИсп.ПолучитьЛицензиюФункциональнойПодсистемы(ИмяЛицензии);
	Возврат ПроверитьДоступностьЛицензииПоКоду(ИмяЛицензии, Лицензия);
КонецФункции

Функция вмс_ЛицензияОХРДоступна()
	ИмяЛицензии = "вмс_ЛицензияОХР";
	Лицензия = вмс_СтандартныеПодсистемыПовтИсп.ПолучитьЛицензиюФункциональнойПодсистемы(ИмяЛицензии);
	Возврат ПроверитьДоступностьЛицензииПоКоду(ИмяЛицензии, Лицензия);
КонецФункции

Функция вмс_ИспользованиеТары() Экспорт
	Возврат вмс_ЛицензияКонтейнерыДоступна() И Справочники.вмс_НастройкиПрограммы.ПолучитьЗначениеНастройкиПрограммы("ИспользоватьТару", Ложь);
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСуперКонтейнер()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипПартии", "Супер контейнер");
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_Контейнеры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.вмс_Контейнеры КАК вмс_Контейнеры
	|ГДЕ
	|	вмс_Контейнеры.ТипТары В
	|			(ВЫБРАТЬ
	|				ТипыКонтейнеров.Ссылка КАК Ссылка
	|			ИЗ
	|				ПланВидовХарактеристик.ТипыКонтейнеров КАК ТипыКонтейнеров
	|			ГДЕ
	|				ТипыКонтейнеров.Наименование = &ТипПартии)
	|	И НЕ вмс_Контейнеры.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.вмс_Контейнеры.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;	
КонецФункции

Функция ПолучитьПустойКонтейнер()
	Возврат Справочники.вмс_Контейнеры.ПустаяСсылка();	
КонецФункции

#КонецОбласти

#Область вмс_ПартионныйУчетСервер

Функция ПолучитьСоставПартии(МассивКонтейнеров, ПолнаяРазузловка=Истина, Товары=Истина, Контейнеры=Истина)
	
	Результат = Новый Структура("Таблица, Товары, Контейнеры");
	
	пОтчет = Отчеты.СКДИерархияКонтейнеров.Создать();
	СКД = пОтчет.СхемаКомпоновкиДанных;
	АдресСхемы = ПоместитьВоВременноеХранилище(СКД);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);
	КомпоновщикНастроек = пОтчет.КомпоновщикНастроек;
	
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.Настройки);
	РаботаССКД.ДобавитьОтбор(КомпоновщикНастроек.Настройки.Отбор.Элементы, "КоличествоКонечныйОстаток", 0, ВидСравненияКомпоновкиДанных.Больше);
	
	НастройкиКомпоновщика = КомпоновщикНастроек.Настройки;
	ПараметрыНастройки = НастройкиКомпоновщика.ПараметрыДанных;
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Контейнер");
	Параметр.Использование = Истина;
	Параметр.Значение = МассивКонтейнеров;
	
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СКД, КомпоновщикНастроек.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Если ПолнаяРазузловка Тогда
		Результат.Таблица = ТаблицаРезультат;
	КонецЕсли;
	
	Если Товары Тогда
		Результат.Товары = ТаблицаРезультат.Скопировать(Новый Структура("Тип",Тип("СправочникСсылка.Номенклатура")));
	КонецЕсли;
	
	Если Контейнеры Тогда
		Результат.Контейнеры = ТаблицаРезультат.Скопировать(Новый Структура("Тип",Тип("СправочникСсылка.вмс_Контейнеры")));
	КонецЕсли;
	
	Возврат Результат;
	
	
КонецФункции // ПолучитьСоставПаллеты()

Функция ПолучитьТаблицуОперацийКонтейнеров(МассивКонтейнеров)
	
	пМассивКонтейнеров = Новый Массив;
	
	Если ТипЗнч(МассивКонтейнеров) = Тип("Массив") Тогда 
		пМассивКонтейнеров = МассивКонтейнеров
	Иначе
		пМассивКонтейнеров.Добавить(МассивКонтейнеров);
	КонецЕсли;
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("МассивКонтейнеров",пМассивКонтейнеров);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОперацииКонтейнеров.Ссылка КАК ТипКонтейнера,
	|	ОперацииКонтейнеров.Операция КАК ОперацияКонтейнера
	|ИЗ
	|	Справочник.вмс_Контейнеры КАК вмс_Контейнеры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ТипыКонтейнеров.ОперацииОтветственногоХранения КАК ОперацииКонтейнеров
	|		ПО вмс_Контейнеры.ТипТары = ОперацииКонтейнеров.Ссылка
	|ГДЕ
	|	НЕ ОперацииКонтейнеров.Ссылка ЕСТЬ NULL
	|	И вмс_Контейнеры.Ссылка В(&МассивКонтейнеров)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОперацииКонтейнеров.Ссылка,
	|	ОперацииКонтейнеров.Операция";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции

Функция ПолучитьВидыПартийДляВидовТоваров(ВидыТоваров)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	вмс_СоединениеОбъектов.ОбъектПриемник КАК ВидТовара,
	|	вмс_СоединениеОбъектов.ОбъектИсточник КАК ВидПартии
	|ИЗ
	|	РегистрСведений.вмс_СоединениеОбъектов КАК вмс_СоединениеОбъектов
	|ГДЕ
	|	вмс_СоединениеОбъектов.ОбъектПриемник В(&ВидыТоваров)
	|	И вмс_СоединениеОбъектов.ОбъектИсточник ССЫЛКА Справочник.вмс_ВидыПартийТоваров
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	вмс_СоединениеОбъектов.ОбъектИсточник,
	|	вмс_СоединениеОбъектов.ОбъектПриемник
	|ИЗ
	|	РегистрСведений.вмс_СоединениеОбъектов КАК вмс_СоединениеОбъектов
	|ГДЕ
	|	вмс_СоединениеОбъектов.ОбъектИсточник В(&ВидыТоваров)
	|	И вмс_СоединениеОбъектов.ОбъектПриемник ССЫЛКА Справочник.вмс_ВидыПартийТоваров";
	Запрос.УстановитьПараметр("ВидыТоваров", ВидыТоваров);
	РезультатЗапроса = Запрос.Выполнить();
	ТаблицаВидыПартийДляВидовТоваров = РезультатЗапроса.Выгрузить();
	
	Возврат ТаблицаВидыПартийДляВидовТоваров;
	
КонецФункции

Функция ПолучитьВидыПартийДляТоваров(Товары)
	
	ТаблицаВидыТоваров = вмс_ОбщегоНазначенияСервер.ПолучитьВидыТоваров(Товары);
	ТаблицаПартииТоваров = ТаблицаВидыТоваров.Скопировать();
	ТаблицаВидыТоваров.Свернуть("ВидТовара");
	ВидыТоваров = ТаблицаВидыТоваров.ВыгрузитьКолонку("ВидТовара"); 
	//ТУ_Мовчан 01.06.23 ++
	Для каждого Строка Из Товары Цикл
		ВидыТоваров.Добавить(Строка); 
	КонецЦикла;
	//ТУ_Мовчан 01.06.23 --
	
	ТаблицаВидыПартийДляВидовТоваров = ПолучитьВидыПартийДляВидовТоваров(ВидыТоваров);
	
	СтрокиТовараУдалить = Новый Массив;
	ТаблицаПартииТоваров.Колонки.Добавить("ВидПартии");
	Для Каждого СтрокаТовара Из ТаблицаПартииТоваров Цикл
		НайденныеСтрокиВидыПартий = ТаблицаВидыПартийДляВидовТоваров.НайтиСтроки(Новый Структура("ВидТовара", СтрокаТовара.ВидТовара));
		Если НайденныеСтрокиВидыПартий.Количество() > 0 Тогда
			СтрокаТовара.ВидПартии = НайденныеСтрокиВидыПартий[0].ВидПартии;
		Иначе
			//ТУ_Мовчан 01.06.23 ++
			НайденныеСтрокиВидыПартий = ТаблицаВидыПартийДляВидовТоваров.НайтиСтроки(Новый Структура("ВидТовара", СтрокаТовара.Товар));
			Если НайденныеСтрокиВидыПартий.Количество() > 0 Тогда
				СтрокаТовара.ВидПартии = НайденныеСтрокиВидыПартий[0].ВидПартии;
			Иначе
				СтрокиТовараУдалить.Добавить(СтрокаТовара);
			КонецЕсли; 
			//ТУ_Мовчан 01.06.23 -- 
			
			//СтрокиТовараУдалить.Добавить(СтрокаТовара);
		КонецЕсли;
	КонецЦикла;
	
	вмс_РаботаСКоллекциями.УдалитьЭлементыКоллекции(ТаблицаПартииТоваров, СтрокиТовараУдалить);
	
	Возврат ТаблицаПартииТоваров;
	
КонецФункции

Функция ПолучитьВидПартииДляМоноТовара(Товар)
	
	ТаблицаПартииТоваров = ПолучитьВидыПартийДляТоваров(Товар);
	Если ТаблицаПартииТоваров.Количество() > 0 Тогда
		Возврат ТаблицаПартииТоваров[0].ВидПартии;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТаблицуСоставаПоКонтейнерам(Контейнеры, ДополнительныеПараметры=Неопределено)
	
	Перем РК;
	
	РК = вмс_РаботаСКоллекциями;
	
	МассивКонтейнеров = РК.ЗначениеВМассив(Контейнеры);
	РК.УдалитьДублиВМассиве(МассивКонтейнеров);
	
	Если ТипЗнч(ДополнительныеПараметры) <> Тип("Структура") Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	
	ТоварныеПоля = РК.ПолучитьЗначениеПоляСтруктуры(ДополнительныеПараметры, "ТоварныеПоля");
	Если ТоварныеПоля <> Неопределено Тогда
		ТоварныеПоляМассив = РК.ЗначениеВМассив(ТоварныеПоля, , Ложь);
	Иначе
		ТоварныеПоляМассив = вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля();		
	КонецЕсли;   
	
	ДополнительныеПараметры.Вставить("ТоварныеПоля", ТоварныеПоляМассив);
	
	//Кулалаев Е.С + 31.05.2023 12:26:19
	//BOX-57 Модуль учета единиц измерения в мобильной версии: Остатки по упаковкам не ведутся. Пока.
	Если ТоварныеПоляМассив.Найти("Упаковка") <> Неопределено Тогда
		вмс_РаботаСКоллекциями.ВычестьМассив(ТоварныеПоляМассив, "Упаковка");
	КонецЕсли;
	//Кулалаев Е.С -
	
	ТоварныеПоля = РК.МассивВСтроку(ТоварныеПоляМассив);
	
	ПоляТаблицыСостава = "ПолныеДанные, Контейнер, ТипКонтейнера, Уровень, %ТОВАРНЫЕПОЛЯ%, СодержимоеКонтейнер, Маркировка, КоличествоОстаток";
	ПоляТаблицыСостава = СтрЗаменить(ПоляТаблицыСостава, "%ТОВАРНЫЕПОЛЯ%", ТоварныеПоля);
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// иерархия вверх
	// Так как контейнеры могут входит в иерархию друг друга надо сделать слияние иерархий, чтобы не было наложений при разузловании
	// Контейнеры ползут вверх, играя в царя горы. Кто доползет первым останется, остальные выбывают
	
	ТаблицаСоставаИерархияВверх = РК.НоваяТаблицаЗначений(ПоляТаблицыСостава);
	
	ПолучитьГоризонтальныеОстаткиДополнительныхУровней = РК.ПолучитьЗначениеПоляСтруктуры(ДополнительныеПараметры, "ПолучитьГоризонтальныеОстаткиДополнительныхУровней") = Истина;
	МаксимальныйУровеньРазузлования = РК.ПолучитьЗначениеПоляСтруктуры(ДополнительныеПараметры, "МаксимальныйУровеньРазузлования");
	Если ТипЗнч(МаксимальныйУровеньРазузлования) <> Тип("Число") Тогда
		МаксимальныйУровеньРазузлования = -1;
	КонецЕсли;
	
	Уровень = 0;
	МассивКонтейнеровДляОбработки = МассивКонтейнеров; 
	МассивКонтейнеровВерхнегоУровня = Новый Массив;
	Проигравшие = Новый Массив;
	Пока МассивКонтейнеровДляОбработки.Количество() > 0 Цикл 
		ТаблицаСоставаСледующийУровень = ПолучитьТаблицуСледующегоУровняСоставаПоКонтейнерам(МассивКонтейнеровДляОбработки, Ложь, ДополнительныеПараметры);
		
		Для Каждого Контейнер Из МассивКонтейнеровДляОбработки Цикл
			Если ТаблицаСоставаСледующийУровень.НайтиСтроки(Новый Структура("Товар", Контейнер)).Количество() = 0 Тогда
				МассивКонтейнеровВерхнегоУровня.Добавить(Контейнер);
			КонецЕсли;
		КонецЦикла;
		
		Если ПолучитьГоризонтальныеОстаткиДополнительныхУровней Тогда
			МассивКонтейнеровСледующегоУровня = РК.ВыгрузитьЗначенияКолонкиКоллекции(ТаблицаСоставаСледующийУровень, "Контейнер");
			ТаблицаСоставаСледующийУровень = ПолучитьТаблицуСледующегоУровняСоставаПоКонтейнерам(МассивКонтейнеровСледующегоУровня, Истина, ДополнительныеПараметры);
		КонецЕсли;
		
		МассивКонтейнеровДляОбработки = Новый Массив;
		Для Каждого СтрокаСоставаСледующийУровень Из ТаблицаСоставаСледующийУровень Цикл
			Если МассивКонтейнеров.Найти(СтрокаСоставаСледующийУровень.Контейнер) <> Неопределено Тогда
				//этот контейнер входит в иерархию другого контейнера
				Проигравшие.Добавить(СтрокаСоставаСледующийУровень.Товар);
				Продолжить;
			КонецЕсли;
			
			СтрокаСостава = ТаблицаСоставаИерархияВверх.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСостава, СтрокаСоставаСледующийУровень);
			СтрокаСостава.ПолныеДанные = Ложь;
			
			Если ТаблицаСоставаИерархияВверх.НайтиСтроки(Новый Структура("Товар", СтрокаСостава.Контейнер)).Количество() = 0 Тогда
				МассивКонтейнеровДляОбработки.Добавить(СтрокаСостава.Контейнер);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	//удалим Проигравшие контейнеры и их позорный путь изгладим из истории
	СтрокиУдалить = Новый Массив;
	Для Каждого Контейнер Из Проигравшие Цикл
		РК.ДобавитьЭлементыКоллекции(СтрокиУдалить, ТаблицаСоставаИерархияВверх.НайтиСтроки(Новый Структура("Контейнер", Контейнер)));
	КонецЦикла;
	
	Для Каждого СтрокаКонтейнера Из СтрокиУдалить Цикл
		Контейнер = СтрокаКонтейнера.Товар;
		Проигравшие.Добавить(Контейнер);
		РК.ДобавитьЭлементыКоллекции(СтрокиУдалить, ТаблицаСоставаИерархияВверх.НайтиСтроки(Новый Структура("Контейнер", Контейнер)));
	КонецЦикла;
	РК.УдалитьЭлементыКоллекции(ТаблицаСоставаИерархияВверх, СтрокиУдалить);
	МассивКонтейнеровДляРазузлования = РК.ВычитаниеМассивов(МассивКонтейнеров, Проигравшие);
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// иерархия вниз (разузлование)
	ТаблицаСоставаИерархияВниз = РК.НоваяТаблицаЗначений(ПоляТаблицыСостава);
	Для Каждого Контейнер Из МассивКонтейнеровДляРазузлования Цикл
		СтрокиКонтейнераИерархияВверх = ТаблицаСоставаИерархияВверх.НайтиСтроки(Новый Структура("Товар", Контейнер));
		Для Каждого СтрокаКонтейнераИерархияВверх Из СтрокиКонтейнераИерархияВверх Цикл
			СтрокаКонтейнераИерархияВниз = ТаблицаСоставаИерархияВниз.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаКонтейнераИерархияВниз, СтрокаКонтейнераИерархияВверх);
			ТаблицаСоставаИерархияВверх.Удалить(СтрокаКонтейнераИерархияВверх);
		КонецЦикла;
	КонецЦикла;
	
	ТипКонтейнер = Тип("СправочникСсылка.вмс_Контейнеры");
	УровеньРазузлования = 0;
	СтрокиКонтейнеровНижнихУровней = Новый Массив;
	Пока МассивКонтейнеровДляРазузлования.Количество() > 0 Цикл
		
		Если МаксимальныйУровеньРазузлования = УровеньРазузлования Тогда
			Прервать;
		КонецЕсли;
		
		ТаблицаСоставаСледующийУровень = ПолучитьТаблицуСледующегоУровняСоставаПоКонтейнерам(МассивКонтейнеровДляРазузлования, Истина, ДополнительныеПараметры);
		Для Каждого Контейнер Из МассивКонтейнеровДляРазузлования Цикл
			Если ТаблицаСоставаСледующийУровень.НайтиСтроки(Новый Структура("Контейнер", Контейнер)).Количество() = 0 Тогда
				СтрокиКонтейнера = ТаблицаСоставаИерархияВниз.НайтиСтроки(Новый Структура("Товар", Контейнер));
				Для Каждого СтрокаСостава Из СтрокиКонтейнера Цикл
					СтрокаСостава.ПолныеДанные = Истина;
					СтрокиКонтейнеровНижнихУровней.Добавить(СтрокаСостава);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		МассивКонтейнеровДляРазузлования = Новый Массив;
		Для Каждого СтрокаСоставаСледующийУровень Из ТаблицаСоставаСледующийУровень Цикл
			СтрокаСостава = ТаблицаСоставаИерархияВниз.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСостава, СтрокаСоставаСледующийУровень);
			СтрокаСостава.ПолныеДанные = Ложь;
			Содержимое = СтрокаСостава.Товар;
			Если ТаблицаСоставаИерархияВниз.НайтиСтроки(Новый Структура("Контейнер", Содержимое)).Количество() = 0 Тогда
				Если ТипЗнч(Содержимое) = ТипКонтейнер Тогда
					МассивКонтейнеровДляРазузлования.Добавить(Содержимое);
				Иначе
					СтрокаСостава.ПолныеДанные = Истина;
					СтрокиКонтейнеровНижнихУровней.Добавить(СтрокаСостава);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		УровеньРазузлования = УровеньРазузлования + 1;
		
	КонецЦикла;
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// проставим признак полноты данных от нижних уровней к верхним
	ОбработанныеСтрокиКонтейнеров = Новый Соответствие;
	Для Каждого СтрокаКонтейнера Из СтрокиКонтейнеровНижнихУровней Цикл
		СтрокиМастерКонтейнера = ТаблицаСоставаИерархияВниз.НайтиСтроки(Новый Структура("Товар", СтрокаКонтейнера.Контейнер));
		Если СтрокиМастерКонтейнера.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаМастерКонтейнера = СтрокиМастерКонтейнера[0];
		
		Если ОбработанныеСтрокиКонтейнеров[СтрокаМастерКонтейнера] <> Истина Тогда
			СтрокаМастерКонтейнера.ПолныеДанные = СтрокаКонтейнера.ПолныеДанные;
			Если СтрокаМастерКонтейнера.ПолныеДанные Тогда
				СтрокиКонтейнеровНижнихУровней.Добавить(СтрокаМастерКонтейнера);
			КонецЕсли;
			ОбработанныеСтрокиКонтейнеров[СтрокаМастерКонтейнера] = Истина;
		ИначеЕсли СтрокаМастерКонтейнера.ПолныеДанные И Не СтрокаКонтейнера.ПолныеДанные Тогда
			СтрокаМастерКонтейнера.ПолныеДанные = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// объединим иерархии вверх и вниз
	ТаблицаСостава = РК.НоваяТаблицаЗначений(ПоляТаблицыСостава);
	РК.ДобавитьЭлементыКоллекции(ТаблицаСостава, ТаблицаСоставаИерархияВверх);
	РК.ДобавитьЭлементыКоллекции(ТаблицаСостава, ТаблицаСоставаИерархияВниз);
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// проставим уровень
	СтрокиКонтейнеров = Новый Массив;
	Для Каждого Контейнер Из МассивКонтейнеровВерхнегоУровня Цикл
		СтрокиКонтейнера = ТаблицаСостава.НайтиСтроки(Новый Структура("Контейнер", Контейнер));
		РК.ДобавитьЭлементыКоллекции(СтрокиКонтейнеров, СтрокиКонтейнера);
	КонецЦикла;
	
	Уровень = 0;
	Пока СтрокиКонтейнеров.Количество() > 0 Цикл
		СтрокиКонтейнеровСледующегоУровня = Новый Массив;
		Для Каждого СтрокаКонтейнера Из СтрокиКонтейнеров Цикл
			СтрокаКонтейнера.Уровень = Уровень;
			СтрокиКонтейнераСледующегоУровня = ТаблицаСостава.НайтиСтроки(Новый Структура("Контейнер", СтрокаКонтейнера.Товар));
			РК.ДобавитьЭлементыКоллекции(СтрокиКонтейнеровСледующегоУровня, СтрокиКонтейнераСледующегоУровня);
		КонецЦикла;
		СтрокиКонтейнеров = СтрокиКонтейнеровСледующегоУровня;
		Уровень = Уровень + 1;
	КонецЦикла;
	
	ТаблицаСостава.Сортировать("Уровень");
	
	ТолькоТовары = РК.ПолучитьЗначениеПоляСтруктуры(ДополнительныеПараметры, "ТолькоТовары") = Истина;
	Если ТолькоТовары Тогда
		ТипКонтейнер = Тип("СправочникСсылка.вмс_Контейнеры");
		ТаблицаТоваров = ТаблицаСостава.СкопироватьКолонки();
		ТаблицаОбходаКонтейнеров = ТаблицаСостава.СкопироватьКолонки();
		Для Каждого Контейнер Из МассивКонтейнеров Цикл
			РК.ДобавитьЭлементыКоллекции(ТаблицаОбходаКонтейнеров, ТаблицаСостава.НайтиСтроки(Новый Структура("Контейнер", Контейнер)));
		КонецЦикла;
		
		Для Каждого СтрокаОбхода Из ТаблицаОбходаКонтейнеров Цикл
			Если ТипЗнч(СтрокаОбхода.Товар) = ТипКонтейнер Тогда
				СтрокиСоставаСледующийУровень = ТаблицаСостава.НайтиСтроки(Новый Структура("Контейнер", СтрокаОбхода.Товар));
				Для Каждого СтрокаСоставаСледующийУровень Из СтрокиСоставаСледующийУровень Цикл
					СтрокаОбходаСледующийУровень = ТаблицаОбходаКонтейнеров.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаОбходаСледующийУровень, СтрокаСоставаСледующийУровень);
					ЗаполнитьЗначенияСвойств(СтрокаОбходаСледующийУровень, СтрокаОбхода, "ПолныеДанные, Контейнер, ТипКонтейнера, Уровень");
				КонецЦикла;
			Иначе
				СтрокаТовара = ТаблицаТоваров.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТовара, СтрокаОбхода);
			КонецЕсли;
		КонецЦикла;
		
		РК.СвернутьТаблицуЗначений(ТаблицаТоваров, , "КоличествоОстаток");
		
		Возврат ТаблицаТоваров;
	КонецЕсли;
	
	Возврат ТаблицаСостава;
	
КонецФункции

Функция ПолучитьВсеТоварыКонтейнеров(Контейнеры, ДополнительныеПараметры=Неопределено)
	
	Перем РК, ДетализироватьПоКонтейнерам;
	
	РК = вмс_РаботаСКоллекциями;
	
	МассивКонтейнеров = РК.ЗначениеВМассив(Контейнеры);
	РК.УдалитьДублиВМассиве(МассивКонтейнеров);
	
	Если ТипЗнч(ДополнительныеПараметры) <> Тип("Структура") Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	
	ТоварныеПоля = Неопределено;
	ДополнительныеПараметры.Свойство("ТоварныеПоля", ТоварныеПоля);
	
	Если ТоварныеПоля <> Неопределено Тогда
		ТоварныеПоляМассив = РК.ЗначениеВМассив(ТоварныеПоля, , Ложь);
	Иначе
		ТоварныеПоляМассив = вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля(); 
	КонецЕсли;  
	
	//Кулалаев Е.С + 31.05.2023 12:26:19
	//BOX-57 Модуль учета единиц измерения в мобильной версии: Остатки по упаковкам не ведутся. Пока.
	Если ТоварныеПоляМассив.Найти("Упаковка") <> Неопределено Тогда
		вмс_РаботаСКоллекциями.ВычестьМассив(ТоварныеПоляМассив, "Упаковка");
	КонецЕсли;
	//Кулалаев Е.С -
	
	
	ДополнительныеПараметры.Вставить("ТоварныеПоля", ТоварныеПоляМассив);
	
	ТоварныеПоля = РК.МассивВСтроку(ТоварныеПоляМассив);
	
	ПоляТаблицыСостава = "Контейнер, Артикул, %ТОВАРНЫЕПОЛЯ%, КоличествоОстаток";
	ПоляТаблицыСостава = СтрЗаменить(ПоляТаблицыСостава, "%ТОВАРНЫЕПОЛЯ%", ТоварныеПоля);
	ТаблицаСостава = РК.НоваяТаблицаЗначений(ПоляТаблицыСостава);
	
	МассивКонтейнеровДляРазузлованияУровня = РК.СкопироватьОбъект(МассивКонтейнеров);
	МассивКонтейнеровДляРазузлования = МассивКонтейнеровДляРазузлованияУровня;
	
	ТипКонтейнер = Тип("СправочникСсылка.вмс_Контейнеры");
	ТаблицаИерархииКонтейнеров = РК.НоваяТаблицаЗначений("МастерКонтейнер, Контейнер, Номер");
	Пока МассивКонтейнеровДляРазузлованияУровня.Количество() > 0 Цикл
		ТаблицаСоставаСледующийУровень = ПолучитьТаблицуСледующегоУровняСоставаПоКонтейнерам(МассивКонтейнеровДляРазузлованияУровня, Истина, ДополнительныеПараметры);
		МассивКонтейнеровДляРазузлованияУровня = Новый Массив;
		Для Каждого СтрокаСоставаСледующийУровень Из ТаблицаСоставаСледующийУровень Цикл
			Если ТипЗнч(СтрокаСоставаСледующийУровень.Товар) = ТипКонтейнер Тогда
				ВложенныйКонтейнер = СтрокаСоставаСледующийУровень.Товар;
				Если ТаблицаИерархииКонтейнеров.НайтиСтроки(Новый Структура("Контейнер", ВложенныйКонтейнер)).Количество() = 0 Тогда
					СтрокаИерархии = ТаблицаИерархииКонтейнеров.Добавить();
					СтрокаИерархии.МастерКонтейнер = СтрокаСоставаСледующийУровень.Контейнер;
					СтрокаИерархии.Контейнер = ВложенныйКонтейнер;
					СтрокаИерархии.Номер = ТаблицаИерархииКонтейнеров.Количество();
				КонецЕсли;
				
				Если МассивКонтейнеровДляРазузлования.Найти(ВложенныйКонтейнер) = Неопределено Тогда
					МассивКонтейнеровДляРазузлования.Добавить(ВложенныйКонтейнер);
					МассивКонтейнеровДляРазузлованияУровня.Добавить(ВложенныйКонтейнер);
				КонецЕсли;
			Иначе
				СтрокаСостава = ТаблицаСостава.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСостава, СтрокаСоставаСледующийУровень);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаИерархииКонтейнеров.Сортировать("Номер УБЫВ");
	
	//дополнить иерархию мастер-контейнерами (у которых нет своих мастеров)
	Для Каждого Контейнер Из МассивКонтейнеров Цикл
		Если ТаблицаИерархииКонтейнеров.НайтиСтроки(Новый Структура("Контейнер", Контейнер)).Количество() > 0 Тогда
			//уже подгружен
			Продолжить;
		КонецЕсли;
		
		СтрокаИерархии = ТаблицаИерархииКонтейнеров.Добавить();
		СтрокаИерархии.МастерКонтейнер = Неопределено;
		СтрокаИерархии.Контейнер = Контейнер;
		СтрокаИерархии.Номер = ТаблицаИерархииКонтейнеров.Количество();
	КонецЦикла;
	
	//формируем полный состав контейнеров с учетом вложенных контейнеров
	ТаблицаПолногоСостава = ТаблицаСостава.Скопировать();
	Для Каждого СтрокаКонтейнера Из ТаблицаИерархииКонтейнеров Цикл
		СтрокиВложенныхКонтейнеров = ТаблицаИерархииКонтейнеров.НайтиСтроки(Новый Структура("МастерКонтейнер", СтрокаКонтейнера.Контейнер));
		Для Каждого СтрокаВложенногоКонтейнера Из СтрокиВложенныхКонтейнеров Цикл
			ТоварыВложенногоКонтейнера = ТаблицаПолногоСостава.НайтиСтроки(Новый Структура("Контейнер", СтрокаВложенногоКонтейнера.Контейнер));
			Для Каждого ТоварВложенногоКонтейнера Из ТоварыВложенногоКонтейнера Цикл
				СтрокаСостава = ТаблицаПолногоСостава.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСостава, ТоварВложенногоКонтейнера);
				СтрокаСостава.Контейнер = СтрокаКонтейнера.Контейнер;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	РК.СвернутьТаблицуЗначений(ТаблицаПолногоСостава, , "КоличествоОстаток");
	
	//вернем результат только по переданным контейнерам (без вложенных контейнеров)
	СтрокиТоваров = Новый Массив;
	Для Каждого Контейнер Из МассивКонтейнеров Цикл
		РК.ДобавитьЭлементыКоллекции(СтрокиТоваров, ТаблицаПолногоСостава.НайтиСтроки(Новый Структура("Контейнер", Контейнер)));
	КонецЦикла;
	ТаблицаСоставаРезультат = ТаблицаПолногоСостава.Скопировать(СтрокиТоваров);
	
	Возврат ТаблицаСоставаРезультат;
	
КонецФункции

Функция ПолучитьТаблицуСледующегоУровняСоставаПоКонтейнерам(Контейнеры, Вниз=Истина, ДополнительныеПараметры=Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТ.Контейнер КАК Контейнер,
	|	ВТ.Товар КАК Товар,
	|	ВТ.Маркировка КАК Маркировка,
	|	ВТ.КоличествоОборот КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.вмс_ОстаткиВКонтейнерах.Обороты(, &Дата, , Контейнер В (&Контейнеры)) КАК ВТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ.Контейнер,
	|	ВТ.Товар,
	|	ВТ.Маркировка,
	|	-ВТ.КоличествоОборот
	|ИЗ
	|	РегистрНакопления.вмс_ОстаткиВКонтейнерах.Обороты(, &Дата, Регистратор, Контейнер В (&Контейнеры)) КАК ВТ
	|ГДЕ
	|	ВТ.Регистратор В(&ТекущиеДокументы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Контейнер КАК Контейнер,
	|	ВТ.Товар КАК Товар,
	|	ВТ.Маркировка КАК Маркировка,
	|	СУММА(ВТ.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ2
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Контейнер,
	|	ВТ.Товар,
	|	ВТ.Маркировка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Контейнер КАК Контейнер,
	|	ВТ.Товар КАК Товар,
	|	ВТ.Маркировка КАК Маркировка,
	|	ВТ.КоличествоОстаток КАК КоличествоОстаток,
	|	ВТ.Контейнер.ТипТары КАК ТипКонтейнера,
	|	ВЫБОР
	|		КОГДА &Товар ССЫЛКА Справочник.вмс_Контейнеры
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СодержимоеКонтейнер,
	|	&Артикул КАК Артикул,
	|	ЛОЖЬ КАК ПолныеДанные
	|ИЗ
	|	ВТ2 КАК ВТ
	|ГДЕ
	|	ВТ.КоличествоОстаток <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контейнер";
	
	РК = вмс_РаботаСКоллекциями;
	
	Если ТипЗнч(ДополнительныеПараметры) <> Тип("Структура") Тогда
		ДополнительныеПараметры = Новый Структура;
	КонецЕсли;
	
	ПустаяДата = '00010101';
	Дата = Неопределено;
	ДополнительныеПараметры.Свойство("Дата", Дата);
	Если ТипЗнч(Дата) <> Тип("Дата") Тогда
		Дата = ПустаяДата;
	КонецЕсли;
	
	ТоварныеПоля = Неопределено;
	ДополнительныеПараметры.Свойство("ТоварныеПоля", ТоварныеПоля);
	Если ТоварныеПоля <> Неопределено Тогда
		ТоварныеПоляМассив = РК.ЗначениеВМассив(ТоварныеПоля, , Ложь);
	Иначе
		ТоварныеПоляМассив = вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля();   
	КонецЕсли;
	
	//Кулалаев Е.С + 31.05.2023 12:26:19
	//BOX-57 Модуль учета единиц измерения в мобильной версии: Остатки по упаковкам не ведутся. Пока.
	Если ТоварныеПоляМассив.Найти("Упаковка") <> Неопределено Тогда
		вмс_РаботаСКоллекциями.ВычестьМассив(ТоварныеПоляМассив, "Упаковка");
	КонецЕсли;
	//Кулалаев Е.С -
	
	ТоварныеПоля = РК.МассивВСтроку(ТоварныеПоляМассив);
	
	ТекущиеДокументы = Неопределено;
	ДополнительныеПараметры.Свойство("ТекущиеДокументы", ТекущиеДокументы);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТ.Товар КАК Товар", ТоварныеПоля);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТ.Товар", ТоварныеПоля);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Артикул", "ВЫРАЗИТЬ(ВТ.Товар КАК Справочник.Номенклатура).Артикул");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Товар", "ВТ.Товар");
	
	Если Вниз <> Истина Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Контейнер В (&Контейнеры)", "Товар В (&Контейнеры)");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Контейнеры", Контейнеры);
	Запрос.УстановитьПараметр("ТекущиеДокументы", ТекущиеДокументы);
	
	РезультатЗапроса = Запрос.Выполнить();
	Таблица = РезультатЗапроса.Выгрузить();
	Возврат Таблица;
	
КонецФункции

Функция СоставКонтейнераУпрощенный(Контейнер = Неопределено)
	Результат = Новый Структура("Успех, Сообщение, Таблица", Ложь, "", Неопределено);
	
	Если НЕ ЗначениеЗаполнено(Контейнер) Тогда
		Результат.Таблица = Новый ТаблицаЗначений;
		Результат.Успех = Истина;
		Возврат Результат;
	КонецЕсли;
	
	ТоварныеПоляМассив = вмс_ОперацииПоЯчейкамВызовСервера.ИспользуемыеТоварныеПоля();
	//""Временное"" решение для работоспособности формы при включенных упаковках в товарных полях (их надо удалить из товарныхъ полей в принципе)
	ИндексУпаковки = ТоварныеПоляМассив.Найти("Упаковка");
	Если ИндексУпаковки <> Неопределено Тогда
		ТоварныеПоляМассив.Удалить(ИндексУпаковки);
	КонецЕсли;
	//
	
	СтрокаВыбор = "";
	Для Каждого ИмяПоля Из ТоварныеПоляМассив Цикл
		СтрокаВыбор = СтрокаВыбор + Символы.Таб + "&t." + ИмяПоля + " КАК " + ИмяПоля + "," + Символы.ПС;
	КонецЦикла;
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|" + СтрЗаменить(СтрокаВыбор, "&t", "вмс_ОперацияПоЯчейкамОстатки") +
	"	вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток КАК Количество
	|ПОМЕСТИТЬ БезАртикула
	|ИЗ
	|	РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки(, Контейнер = &Контейнер) КАК вмс_ОперацияПоЯчейкамОстатки
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|" + СтрЗаменить(СтрокаВыбор, "&t", "БезАртикула") +
	"	БезАртикула.Количество КАК Количество,
	|	Номенклатура.Артикул КАК Артикул
	|ИЗ
	|	БезАртикула КАК БезАртикула
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО БезАртикула.Товар = Номенклатура.Ссылка";
	Запрос.УстановитьПараметр("Контейнер", Контейнер);
	
	Результат.Таблица = Запрос.Выполнить().Выгрузить();
	Результат.Успех = Истина;
	Возврат Результат;
КонецФункции

//

#КонецОбласти 

#Область ВИП

Функция ЭтоВИП(Имя) Экспорт
	
	РК = вмс_РаботаСКоллекциями;
	
	ВИПы = РК.СтрокуВМассив(ПолучитьСтрокуИзДвоичныхДанных(ПолучитьМакет("gymvip")), Символы.ПС);
	
	Инициалы = РК.СтрокуВМассив(Строка(Имя), " ");
	Для ИндексИнициала=0 По Инициалы.ВГраница() Цикл
		Инициалы[ИндексИнициала] = нрег(Инициалы[ИндексИнициала]);
	КонецЦикла;
	
	Для Каждого ВИП из ВИПы Цикл
		Опознан = Истина;
		ИнициалыВИП = РК.СтрокуВМассив(ВИП, " ");
		Для Каждого ИнициалВИП Из ИнициалыВИП Цикл
			Если Инициалы.Найти(нрег(ИнициалВИП))=Неопределено Тогда
				Опознан = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Опознан Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ЗагрузитьЗвуковуюСхемуВИП() Экспорт
	
	вмс_ОбновлениеИнформационнойБазы.ЗагрузитьПредопределенныеОбъектыИБИзДанныхXML(ПолучитьМакет("gymsfx"));
	
КонецФункции

#КонецОбласти

	
#КонецЕсли
